//*************************************************************
Процедура ОбновленияИндексаПолнотекстовогоПоиска() Экспорт
	
	Если Не ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска()
		= РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

//*************************************************************
Функция ПолучитьПараметрСеанса(ПараметрСеанса) Экспорт
	
	Попытка
		Возврат ПараметрыСеанса[ПараметрСеанса];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

//*************************************************************
Процедура УстановитьПараметрСеанса(ПараметрСеанса,Значение) Экспорт
	
	Попытка
		ПараметрыСеанса[ПараметрСеанса]=Значение;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

//*************************************************************
Функция ПолучитьКонстанту(Константа) Экспорт
	
	Попытка
		Возврат Константы[Константа].Получить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

//*************************************************************
Процедура УстановитьКонстанту(ПараметрСеанса,Значение) Экспорт
	
	Попытка
		Константы[ПараметрСеанса].Установить(Значение);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьФО(ФО) Экспорт
	Возврат ПолучитьФункциональнуюОпцию(ФО);
КонецФункции
 
Функция ПолучитьСледующийКод(Родитель) Экспорт
	Код = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТС_Тесты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ТС_Тесты КАК ТС_Тесты
		|ГДЕ
		|	ТС_Тесты.Родитель В ИЕРАРХИИ(&Родитель)
		|	И ТС_Тесты.Ссылка <> &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Код = ВыборкаДетальныеЗаписи.Наименование;
		Код = Сред(Код, 0, СтрНайти(Код, ".")-1) + "." + (Число(Сред(Код, СтрНайти(Код, ".")+1))+1);
	КонецЦикла;

	Возврат Код;
КонецФункции

Функция ПреобразоватьТаблицуЗначенийВМассивСтруктур(п_ТЗ) Экспорт
	
	Массив = Новый Массив();
	
	СтруктураСтрокой = "";
	НужнаЗапятая 	 = Ложь;
	
	Для Каждого Колонка Из п_ТЗ.Колонки Цикл
		
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая     = Истина;
		
	КонецЦикла;
	
	Для Каждого Строка Из п_ТЗ Цикл
		
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Массив.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Массив;

КонецФункции