//**************************************************************
Функция ПостроитьСтрокуПравильныхОтветов(ТекТест) Экспорт
	
	СтрокаОтвет = "";
	Для Каждого Строка ИЗ ТекТест.Ответы Цикл
		Если Строка.Правильный Тогда 
			СтрокаОтвет = ?(СтрДлина(СтрокаОтвет)=0,"",СтрокаОтвет + ", ") + Строка(Строка.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаОтвет;
	
КонецФункции

//**************************************************************
Функция УстановитьПравильностьОтветов(ТекДокумент) Экспорт
	
	ТекОбъект = ТекДокумент.ПолучитьОбъект();
	
	Для Каждого Строка ИЗ ТекОбъект.Тесты Цикл
		СтрокаПравильных = ПостроитьСтрокуПравильныхОтветов(Строка.Тест);
		Строка.Правильный = СтрокаПравильных = Строка.Ответ;
	КонецЦикла;
	
	Попытка
		ТекОбъект.Записать();
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
