
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ФормаНачальнойСтраницы = ПолучитьФорму("ОбщаяФорма.ТС_ФормаНачальнойСтраницы");
	
	ОбработкаЗакрытия = Новый ОписаниеОповещения("НастройкиПользователяЗавершение",ФормаНачальнойСтраницы,);
	
	СтруктураПараметров = Новый Структура("Ключ",ТС_ОбщегоНазначенияКлиент.ПолучитьТекущегоПользователя());
	ОткрытьФорму("Справочник.ТС_Пользователи.Форма.ФормаЭлемента",СтруктураПараметров,,,,,ОбработкаЗакрытия);
	
КонецПроцедуры

