
&НаСервере
Процедура ЗагрузитьНаСервере(ПомещенныеИзображения)
	
	ВсеПапки = НайтиФайлы(ПутьКПапке, "*", Ложь);
	
	Для Каждого Папка Из ВсеПапки Цикл
		
		Если Не Папка.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		Сообщить("Обрабатывается: "+Папка.Имя);
		Курс = Справочники.ТС_Курсы.НайтиПоНаименованию(Папка.Имя);
		Если Не ЗначениеЗаполнено(Курс) Тогда
			НовыйКурс = Справочники.ТС_Курсы.СоздатьЭлемент();
			НовыйКурс.Наименование = Папка.Имя;
			НовыйКурс.УстановитьНовыйКод();
			НовыйКурс.Записать();
			Курс = НовыйКурс.Ссылка;
		КонецЕсли;
		
		ВсеФайлы = НайтиФайлы(Папка.ПолноеИмя+"\", "*.txt", Ложь);
		
		Если ВсеФайлы.Количество() < 14 Тогда
			Сообщить(Папка.Имя + ": Количество разделов меньше 14. Не обработано.");
			Возврат;
		КонецЕсли; 
		
		НачатьТранзакцию();
		
		Попытка
			Для Каждого Файл Из ВсеФайлы Цикл
				
				ИмяФайла = Файл.ИмяБезРасширения;
				
				ФайлЗагрузки = Новый ТекстовыйДокумент;
				ФайлЗагрузки.Прочитать(Файл.ПолноеИмя, КодировкаТекста.UTF8);
				
				Если ФайлЗагрузки.КоличествоСтрок() = 0 Тогда
					Сообщить("Файл: "+ИмяФайла+" пустой. Обработка курса прервана.");
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
				
				Вопрос = Неопределено;
				НаборОбъект = Справочники.ТС_НаборыТестов.СоздатьЭлемент();
				НаборОбъект.Владелец = Курс;
				НаборОбъект.Наименование = ИмяФайла;
				
				Родитель = Справочники.ТС_Тесты.СоздатьГруппу();
				Родитель.Владелец = Курс;
				Родитель.Наименование = ИмяФайла;
				Родитель.Записать();
				Родитель = Родитель.Ссылка;
				
				НомерРаздела = Лев(ИмяФайла, 2);
				
				НовыйВопрос = Истина;
				Для i=1 По ФайлЗагрузки.КоличествоСтрок() Цикл
					
					СтрокаФайла = ФайлЗагрузки.ПолучитьСтроку(i);
					
					Если Не ЗначениеЗаполнено(СтрокаФайла) Тогда
						Вопрос.Записать();
						НоваяСТрока = НаборОбъект.Содержание.Добавить();
						НоваяСТрока.Тест = Вопрос.Ссылка;
						НовыйВопрос = Истина;
						Продолжить;
					КонецЕсли; 
					
					Если НовыйВопрос Тогда
						НомерВопроса = Сред(Лев(СтрокаФайла, Найти(Сред(СтрокаФайла, 2), "#")), 2);
						Вопрос = Справочники.ТС_Тесты.СоздатьЭлемент();
						Вопрос.Владелец = Курс;
						Вопрос.Родитель = Родитель;
						Вопрос.Наименование = НомерРаздела + "." + НомерВопроса;
						Вопрос.Вопрос = Сред(СтрокаФайла, СтрДлина(НомерВопроса) + 3);
						НовыйВопрос = Ложь;
					Иначе
						Если Лев(СтрокаФайла, 5) = "#pic#" Тогда
							Вопрос.Записать();
							Адрес = ПомещенныеИзображения.Получить(Папка.ПолноеИмя+"/"+Сред(СтрокаФайла, 6));
							ЗагрузитьИзображениеСервер(Адрес, Вопрос);
						Иначе	
							Ответ = Вопрос.Ответы.Добавить();
							Если Лев(СтрокаФайла, 3) = "(V)" Тогда
								Ответ.Ответ = Сред(СтрокаФайла, 4);
								Ответ.Правильный = Истина;
							Иначе
								Ответ.Ответ = СтрокаФайла;
							КонецЕсли; 
						КонецЕсли; 
					КонецЕсли;
					
				КонецЦикла;
				
				Если Вопрос.ЭтоНовый() Тогда
					Вопрос.Записать();
					НоваяСТрока = НаборОбъект.Содержание.Добавить();
					НоваяСТрока.Тест = Вопрос.Ссылка;
				КонецЕсли;
				
				НаборОбъект.Записать();
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	//ПутьКФайлам = ПутьКПапке+НаименованиеКурса()+"\";
	//ЕстьФайлы = НайтиФайлы(ПутьКФайлам, "*.tif", Ложь).Количество() > 0;
	//Если ЕстьФайлы Тогда
	//	ПомещенныеИзображения = ЗагрузитьИзображения();
	//Иначе
	//	ПомещенныеИзображения = Новый Соответствие;
	//КонецЕсли; 
	//ЗагрузитьНаСервере(ПомещенныеИзображения);
	//ПутьКФайлам = ?(Прав(ПутьКПапке, 1) = "\", ПутьКПапке, ПутьКПапке + "\")+НаименованиеКурса()+"\";
	
	ВсеПапки = НайтиФайлы(?(Прав(ПутьКПапке, 1) = "\", ПутьКПапке, ПутьКПапке + "\"), "*", Ложь);
	
	ПомещенныеИзображения = Новый Соответствие;
	
	Для Каждого Папка Из ВсеПапки Цикл
		
		Если Не Папка.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКФайлам = Папка.ПолноеИмя + "\";
		ЗагрузитьИзображения2(ПомещенныеИзображения, "*.tif");
		ЗагрузитьИзображения2(ПомещенныеИзображения, "*.gif");
		ЗагрузитьИзображения2(ПомещенныеИзображения, "*.png");
		ЗагрузитьИзображения2(ПомещенныеИзображения, "*.jpeg");
		ЗагрузитьИзображения2(ПомещенныеИзображения, "*.bmp");
		
	КонецЦикла;
	
	ЗагрузитьНаСервере(ПомещенныеИзображения);
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьИзображения()
	ПомещенныеФайлы = Новый Массив;
	ПоместитьФайлы(,ПомещенныеФайлы, ПутьКФайлам + "*.tif", Ложь);
	Соответствие = Новый Соответствие;
	Для Каждого Описание Из ПомещенныеФайлы Цикл
		Соответствие.Вставить(Сред(Описание.Имя, СтрДлина(ПутьКФайлам)+1), Описание.Хранение);
	КонецЦикла; 
	Возврат Соответствие;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзображения2(ПомещенныеИзображения, Расширение)
	Если НайтиФайлы(ПутьКФайлам, Расширение, Ложь).Количество() > 0 Тогда
		ПомещенныеФайлы = Новый Массив;
		ПоместитьФайлы(,ПомещенныеФайлы, ПутьКФайлам + Расширение, Ложь);
		Для Каждого Описание Из ПомещенныеФайлы Цикл
			ПомещенныеИзображения.Вставить(Описание.Имя, Описание.Хранение);
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите файл исходных данных";

	Если Диалог.Выбрать() Тогда		
		ЭтаФорма.ПутьКПапке = Диалог.Каталог+"\";		
		//ЭтаФорма.ИмяФайла = СтрЗаменить(СтрЗаменить(Диалог.ПолноеИмяФайла, Диалог.Каталог, ""), ".txt", "");		
	Иначе
		ЭтаФорма.ПутьКПапке = "";
	КонецЕсли;
КонецПроцедуры
 
&НаСервере
Процедура ЗагрузитьИзображениеСервер(Адрес, Вопрос)
	
	//создаем новый элемент в Справочнике Файлы
	НовыйФайлИзображения = Справочники.ТС_Файлы.СоздатьЭлемент();
	НовыйФайлИзображения.Наименование = "Изображение к тесту: " + Строка(Вопрос.Владелец) + ", " + Строка(Вопрос.Наименование);
	НовыйФайлИзображения.Источник = Вопрос;
	
	//в реквизит СправочникаФайлы Файл помещаем выбранную ранее Картинку
	НовыйФайлИзображения.Изображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
	Изображение = ПоместитьВоВременноеХранилище(НовыйФайлИзображения.Изображение.Получить());
	
	//записываем новый элемент справочника Файлы
	Попытка
		НовыйФайлИзображения.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//устанавливаем значение реквизита Картинка Справочника Сотрудники
	Вопрос.Изображение = НовыйФайлИзображения.Ссылка;
	
КонецПроцедуры

