///////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

//*************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Группа2.Видимость = Константы.ТС_ИспользоватьИзбранныеТесты.Получить();
	
	ИзменитьВидимостьПропускаНеправильныхОтветов(); 
КонецПроцедуры



///////////////////////////////////////////////////////////////
// ДЕЙСТВИЯ ФОРМЫ

//*************************************************************
&НаКлиенте
Процедура НеВыделятьОтмеченныеТестыПриИзменении(Элемент)
	
	Объект.НеВыделятьОтмеченныеТестыТолькоДляВебКлиента = Объект.НеВыделятьОтмеченныеТесты;
		
КонецПроцедуры

//*************************************************************
&НаКлиенте
Процедура ОткрыватьФормуТестированияВНовомОкнеПриИзменении(Элемент)
	
	Объект.ОткрыватьФормуТестированияВНовомОкнеТолькоДляВебКлиента = Объект.ОткрыватьФормуТестированияВНовомОкне;
	
КонецПроцедуры

//*************************************************************
&НаКлиенте
Процедура ШиринаФормыТестированияПриИзменении(Элемент)
	
	Объект.ШиринаФормыТестированияТолькоДляВебКлиента = ?(Объект.ШиринаФормыТестирования=0,Ложь,Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПереходитьКСледующемуПриВыбореПриИзменении(Элемент)
	ИзменитьВидимостьПропускаНеправильныхОтветов();
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьПропускаНеправильныхОтветов()
	
	Если Не Объект.ПереходитьКСледующемуПриВыборе Тогда
		Объект.ПропускатьНеправильныеОтветы = Ложь; 
		Элементы.ГруппаПропускатьНеПравильныеОтветы.Доступность = Ложь;
	Иначе
		Элементы.ГруппаПропускатьНеПравильныеОтветы.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

