///////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

//*************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец")
		Тогда
		ЭтаФорма.Курс = Параметры.Отбор.Владелец;
		ЭтаФорма.Элементы.Курс.Доступность = Ложь;
	Иначе
		ОтборПоКурсу = ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Вставить(0,Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоКурсу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоКурсу.Использование = Истина;
		ОтборПоКурсу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ОтборПоКурсу.ПравоеЗначение = ЭтаФорма.Курс;
		ОтборПоКурсу.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;	
	
КонецПроцедуры



///////////////////////////////////////////////////////////////
// ДЕЙСТВИЯ ФОРМЫ

//*************************************************************
&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = ЭтаФорма.Курс;
	
КонецПроцедуры

