//*************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсходныйТекст") Тогда
		ЭтаФорма.ИсходныйТекст = Параметры.ИсходныйТекст;
	КонецЕсли;
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;	
	
КонецПроцедуры

//*************************************************************
&НаКлиенте
Процедура ТекстHTMLДокументСформирован(Элемент)
	
	ЭтаФорма.ТекстHTML = 
	"<html>
	|<body>
	|" + ЭтаФорма.ИсходныйТекст + "
	|</body>
	|</html>";
	
КонецПроцедуры


&НаКлиенте
Процедура htmlПоле(Команда)
	Элементы.ТекстHTML.Вид = ВидПоляФормы.ПолеHTMLДокумента;
КонецПроцедуры

