Функция ПолучитьРандомныйНаборВопросов(Курс, Перемешивать = Истина) Экспорт
	
	МассивВопросов = Новый Массив;
	
	ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТС_НаборыТестовСодержание.Ссылка КАК Набор,
	               |	ТС_НаборыТестовСодержание.Тест
	               |ИЗ
	               |	Справочник.ТС_НаборыТестов.Содержание КАК ТС_НаборыТестовСодержание
	               |ГДЕ
	               |	ТС_НаборыТестовСодержание.Ссылка.Владелец = &Курс
	               |	И ПОДСТРОКА(ТС_НаборыТестовСодержание.Ссылка.Наименование, 1, 1) <> ""_""
	               |ИТОГИ ПО
	               |	Набор";
	Запрос.УстановитьПараметр("Курс", Курс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Наборы = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВсегоНаборов = Наборы.Строки.Количество();
	Для Каждого Набор Из Наборы.Строки Цикл
		
		Тесты = Набор.Строки;
		ГСЧ = Новый ГенераторСлучайныхЧисел(ТекДата);
		МассивВопросов.Добавить(Тесты[ГСЧ.СлучайноеЧисло(1, Тесты.Количество())-1].Тест);
		ТекДата = ТекДата + 1
		
	КонецЦикла;
	
	//перемешиваем
	Если Перемешивать Тогда
		ПеремешатьНабор(МассивВопросов);
	КонецЕсли; 
	
	Возврат МассивВопросов;
	
КонецФункции

Процедура ПеремешатьНабор(МассивВопросов) Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	ВсегоВопросов = МассивВопросов.Количество();
	
	МассивВопросовПеремешанный = Новый Массив;
	Для Каждого Вопрос Из МассивВопросов Цикл
		МассивВопросовПеремешанный.Вставить(ГСЧ.СлучайноеЧисло(1, ВсегоВопросов), Вопрос);
	КонецЦикла;
	
	МассивВопросов.Очистить();
	
	Для Каждого Вопрос Из МассивВопросовПеремешанный Цикл
		Если ЗначениеЗаполнено(Вопрос) Тогда
			МассивВопросов.Добавить(Вопрос);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
 