//*************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Элементы.ВерсияКонфигурации.Заголовок = Метаданные.Версия;
	ЭтаФорма.Элементы.ЭлектронноыйАдрес.Заголовок = Метаданные.Поставщик;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ТС_Курсы.Ссылка, 0)) КАК Количество
		|ИЗ
		|	Справочник.ТС_Курсы КАК ТС_Курсы
		|ГДЕ
		|	НЕ ТС_Курсы.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		 ЭтаФорма.Элементы.КоличествоЭкзаменов.Заголовок = 0;
	Иначе
		ЭтаФорма.Элементы.КоличествоЭкзаменов.Заголовок = РезультатЗапроса.Выгрузить()[0].Количество;
	КонецЕсли;
	
	ЭтаФорма.РегистрацияАдрес = Константы.ТС_РегистрацияАдрес.Получить();
	ЭтаФорма.РегистрацияИмя = Константы.ТС_РегистрацияИмя.Получить();
	Если ЗначениеЗаполнено(ЭтаФорма.РегистрацияАдрес) Тогда
		ЭтаФорма.Элементы.НадписьРегистрация.Заголовок = "Программа зарегистрированна на:";
		ЭтаФорма.Элементы.Зарегистрировать.Видимость = Ложь;
		ЭтаФорма.Элементы.РегистрацияАдрес.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.РегистрацияИмя.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

//*************************************************
&НаКлиенте
Процедура ЭлектронноыйАдресНажатие(Элемент)
	
	Попытка
		ЗапуститьПриложение("mailto:" + ЭтаФорма.Элементы.ЭлектронноыйАдрес.Заголовок);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

//*************************************************
&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	//Проверим, верно ли указан адрес электронной почты?
	Если Найти(ЭтаФорма.РегистрацияАдрес,"@") = 0 
		ИЛИ Найти(ЭтаФорма.РегистрацияАдрес,".") = 0 Тогда
		ПоказатьПредупреждение(,"Электронный адрес указан не верно. 
		|Пожалуйста, введите корректный адрес электронной почты!");
		Возврат;
	КонецЕсли;
	
	УчетнаяЗапись = ПолучитьПрофильЭлектроннойПочты();	
	СписокВложений = "";

    loConfig         			= Новый COMОбъект("CDO.Configuration");
    loCdoMessage     			= Новый COMОбъект("CDO.Message");
    loCdoMessage.Configuration 	= loConfig;
    loCdoMessage.From    		= Строка("Служба рассылки """" <"+УчетнаяЗапись.АдресЭлектроннойПочты+">");
    loCdoMessage.To      		= СокрЛП(ЭтаФорма.Элементы.ЭлектронноыйАдрес.Заголовок);
	loCdoMessage.Subject 		= "Регистрация программы ""(ТС) Подготовка к тестированию""";
	loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpserver").           Value = УчетнаяЗапись.АдресSMTP;
    loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpserverport").       Value = УчетнаяЗапись.ПортSMTP;
	loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/sendusername").         Value = УчетнаяЗапись.АдресЭлектроннойПочты;
    loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/sendpassword").         Value = УчетнаяЗапись.ПарольSMTP;
	loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/sendusing").            Value = 2;
    loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpauthenticate").     Value = 1;
    loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpusessl").           Value = 1;
    loConfig.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpconnectiontimeout").Value = 60;
	loConfig.Fields.Update();
	
    loCdoMessage.HTMLBody = "<html>
    |<head>
    |<meta content=""text/html; charset=Windows-1251"" http-equiv=""content-type"">
    |<title> Регистрация программы ""(ТС) Подготовка к тестированию"" </title>
    |</head>
    |<body>
    |<h4> Регистрация программы ""(ТС) Подготовка к тестированию"" </h4>
    |<p></p>
	|<p>--- Данные программы:</p>
	|<p>Версия программы: " + ЭтаФорма.Элементы.ВерсияКонфигурации.Заголовок + "</p>
	|<p>Количество экзаменов: " + ЭтаФорма.Элементы.КоличествоЭкзаменов.Заголовок + "</p>
	|<p>ID: zs1e_1</p>
	|<p></p>
	|<p>--- Данные пользователя:</p>
	|<p>Имя: " + СокрЛП(ЭтаФорма.РегистрацияИмя) + "</p>
	|<p>Эл. адрес: " + СокрЛП(ЭтаФорма.РегистрацияАдрес) + "</p>
	|<p></p>
    |</body>
    |</html>";

    Если ТипЗнч(СписокВложений) = Тип("Строка") И Не СписокВложений = "" Тогда
        Попытка
            loCdoMessage.AddAttachment(СписокВложений);
        Исключение
        КонецПопытки;
    ИначеЕсли ТипЗнч(СписокВложений) = Тип("СписокЗначений") Тогда
        Для каждого ПутьКВложению Из СписокВложений Цикл
            Попытка
                loCdoMessage.AddAttachment(ПутьКВложению.Значение);
            Исключение
            КонецПопытки;
        КонецЦикла;
    КонецЕсли;

    Попытка
        loCdoMessage.Send();
		ЭтаФорма.Элементы.НадписьРегистрация.Заголовок = "Программа зарегистрированна на:";
		ЭтаФорма.Элементы.Зарегистрировать.Видимость = Ложь;
		ЭтаФорма.Элементы.РегистрацияАдрес.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.РегистрацияИмя.ТолькоПросмотр = Истина;
		СохранитьДанныеРегистрации();
		ПоказатьПредупреждение(,"Спасибо, программа успешно зарегистрированна!");
    Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

//*************************************************
&НаСервере
Функция ПолучитьПрофильЭлектроннойПочты()
	
	УчетнаяЗапись = Справочники.ТС_УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗапись;
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("АдресЭлектроннойПочты",УчетнаяЗапись.АдресЭлектроннойПочты);
	СтруктураПолей.Вставить("АдресSMTP",УчетнаяЗапись.АдресSMTP);
	СтруктураПолей.Вставить("ЛогинSMTP",УчетнаяЗапись.ЛогинSMTP);
	СтруктураПолей.Вставить("ПарольSMTP",УчетнаяЗапись.ПарольSMTP);
	СтруктураПолей.Вставить("ПортSMTP",УчетнаяЗапись.ПортSMTP);
	Возврат СтруктураПолей;
	
КонецФункции

//*************************************************
&НаСервере
Процедура СохранитьДанныеРегистрации()
	
	Константы.ТС_РегистрацияИмя.Установить(СокрЛП(ЭтаФорма.РегистрацияИмя));
	Константы.ТС_РегистрацияАдрес.Установить(СокрЛП(ЭтаФорма.РегистрацияАдрес));

КонецПроцедуры	
