//**************************************************************
&НаСервере
Функция ЗаписатьДокументСервер()
	
	Попытка
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.Записать();
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
КонецФункции

//**************************************************************
&НаСервере
Функция ПостроитьСтрокуПравильныхОтветов(ТекТест)
	
	Возврат Документы.ТС_РезультатТестирования.ПостроитьСтрокуПравильныхОтветов(ТекТест);
	
КонецФункции
	
//**************************************************************
&НаКлиенте
Процедура УстановитьПравильностьОтветов(Команда)
	
	Для Каждого Строка ИЗ Объект.Тесты Цикл
		СтрокаПравильных = ПостроитьСтрокуПравильныхОтветов(Строка.Тест);
		Строка.Правильный = СтрокаПравильных = Строка.Ответ;
	КонецЦикла;
	
КонецПроцедуры

//**************************************************************
&НаКлиенте
Процедура ПодобратьТест(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Курс) Тогда
		ПоказатьПредупреждение(,"Не выбран курс!");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПодобратьТекстЗавершение",ЭтаФорма, );
	ПоказатьВводСтроки(Оповещение,,"Введите текст вопроса для поиска",,Ложь);
	
КонецПроцедуры

//**************************************************************
&НаКлиенте
Процедура ПодобратьТекстЗавершение(Строка, Параметры) Экспорт
	
	Если НЕ Строка = Неопределено Тогда
		Результат =  ПодобратьТестНаСервере(Строка);
		Если Результат <> Истина Тогда
			ПоказатьПредупреждение(,Результат);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры	

//**************************************************************
&НаСервере
Функция ПодобратьТестНаСервере(СтрокаПоиска)
	
	СтрокаПоиска = СокрЛП(СтрЗаменить(СтрокаПоиска,"""",""""""));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС_Тесты.Ссылка
	|ИЗ
	|	Справочник.ТС_Тесты КАК ТС_Тесты
	|ГДЕ
	|	ТС_Тесты.Владелец = &Курс
	|	И ТС_Тесты.Вопрос ПОДОБНО ""%" + СтрокаПоиска + "%""";
	
	Запрос.УстановитьПараметр("Курс", Объект.Курс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "Тест не найдено!";
	КонецЕсли;
	
	ТЗРезультат = РезультатЗапроса.Выгрузить();
	Если ТЗРезультат.Количество() > 1 Тогда
		Возврат "Найдено несколько вариантов. Уточните запрос!";
	КонецЕсли;
	
	НоваяСтрока = Объект.Тесты.Добавить();
	НоваяСтрока.Тест = ТЗРезультат[0].Ссылка;
	
	Возврат Истина;	
	
КонецФункции

