
/////////////////////////////////////////////////////////////////////////
// РАСШИФРОВКА

&НаСервере
//*******************************************************************
Функция ПолучитьПолеРасшифровки(Расшифровка);
	
	СтруктураРасшифровки = Новый Структура("Поле,Значение");
	Поле = ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы[Расшифровка].ПолучитьПоля()[0];
	СтруктураРасшифровки.Поле = Поле.Поле;
	СтруктураРасшифровки.Значение = Поле.Значение;
	Возврат СтруктураРасшифровки;

КонецФункции

//*******************************************************************
&НаСервере
Процедура ВывестиЗначениеГруппировки(ТекРасшифровка, СтруктураРасшифровки)
	
	МассивРодителей = ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы[ТекРасшифровка].ПолучитьРодителей();
	Для Сч = 1 По МассивРодителей.Количество() Цикл
	
		ПолеРодитель = МассивРодителей[Сч-1];
		Если Число(ПолеРодитель.Идентификатор) > 0 Тогда
			
			//Получим текущее поле
			Если ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда 								
		 		Поле = ПолеРодитель.ПолучитьПоля()[0];                				
			ИначеЕсли ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда				
				Поле =	 ПолеРодитель.ПолучитьРодителей()[0].ПолучитьПоля()[0] ;	 
			КонецЕсли;
			
			//Выведем значения текущей расшифровки
			//Сообщить("Поле: " + Поле.Поле + ", значение: " + Поле.Значение);
			Если НЕ СтруктураРасшифровки.Свойство(Поле.Поле) Тогда 
				СтруктураРасшифровки.Вставить(Поле.Поле, Поле.Значение);
			КонецЕсли;
			
			//Рекурсивный вызов процедуры. 
			РасшифровкиВыше = ПолеРодитель.ПолучитьРодителей()[0].Идентификатор;
			ВывестиЗначениеГруппировки(РасшифровкиВыше, СтруктураРасшифровки);
			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
//***********************************************************************
Функция ПолучитьПолноеИмяФормы(ИмяФормы)

    СимволТочка = ".";
    ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
	Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл 
		ПозицияТочки = ПозицияТочки - 1; 
	КонецЦикла; 
    Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;

КонецФункции

//***********************************************************************
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	//Структура расшифровки
	СтруктураРасшифровки = ПолучитьПолеРасшифровки(Расшифровка);

	ТипРасшифровки = СтруктураРасшифровки.Поле;
   
	Если ТипРасшифровки = "Вопрос"
		ИЛИ ТипРасшифровки = "НомерСтроки"
		ИЛИ ТипРасшифровки = "Ответ" Тогда
		
		СтруктураРасшифровки.Очистить();
		
		//Значения всех вышестоящих группировок		
		ВывестиЗначениеГруппировки(Расшифровка, СтруктураРасшифровки);
		
		Если СтруктураРасшифровки.Свойство("Ссылка") Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("Справочник.ТС_Тесты.ФормаОбъекта",Новый Структура("Ключ",СтруктураРасшифровки.Ссылка));
		КонецЕсли;
		
	ИначеЕсли ТипРасшифровки = "ЕстьПодтверждение" Тогда
		
		 СтруктураРасшифровки.Очистить();
		
		//Значения всех вышестоящих группировок		
		ВывестиЗначениеГруппировки(Расшифровка, СтруктураРасшифровки);
		
		Если СтруктураРасшифровки.Свойство("Ссылка") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура(
				"Параметры,ИмяМенеджераПечати,ЗаголовокФормы",
				СтруктураРасшифровки.Ссылка,"Справочники.ТС_Тесты.ПечатьПодтверждения","Подтверждение ответа теста");
			ОткрытьФорму("ОбщаяФорма.ТС_ФормаПечати", ПараметрыФормы);
		КонецЕсли;
						
	ИначеЕсли ТипРасшифровки = "Ссылка" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ТС_Тесты.ФормаОбъекта",Новый Структура("Ключ",СтруктураРасшифровки.Значение));

	КонецЕсли;	
    	
КонецПроцедуры


