
&НаСервере
Процедура ВыполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_Тесты.Ссылка,
		|	ТС_Тесты.Наименование
		|ИЗ
		|	Справочник.ТС_Тесты КАК ТС_Тесты
		|ГДЕ
		|	ТС_Тесты.ЭтоГруппа
		|	И ВЫБОР
		|			КОГДА &УказанКурс = ИСТИНА
		|				ТОГДА ТС_Тесты.Владелец = &Курс
		|			ИНАЧЕ ИСТИНА = ИСТИНА
		|		КОНЕЦ";
	Запрос.Параметры.Вставить("УказанКурс", ЗначениеЗаполнено(Курс));
	Запрос.Параметры.Вставить("Курс", Курс);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивВозможныхНомеров = Новый Массив;
	Для Сч = 1 По 14 Цикл
		Префикс = "";
		Если СтрДлина(Строка(Сч)) = 1 Тогда Префикс = "0"; КонецЕсли;
		МассивВозможныхНомеров.Добавить(Префикс + Сч + ".");
	КонецЦикла;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Наименование = ВыборкаДетальныеЗаписи.Наименование;
		ПодстрокаСНомером = Сред(ВыборкаДетальныеЗаписи.Наименование, 1,3);
		Если МассивВозможныхНомеров.Найти(ПодстрокаСНомером) <> Неопределено Тогда
			СоздатьЗаполнитьНаборТестов(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаполнитьНаборТестов(РазделТестов)
	РодительТестов = РазделТестов.Родитель;
	Наименование = РазделТестов.Наименование;
	Курс = РазделТестов.Владелец;
	Если ЗначениеЗаполнено(РодительТестов) Тогда
		РодительНаборТестов = Справочники.ТС_НаборыТестов.НайтиПоНаименованию(РодительТестов.Наименование,,,Курс);
		Если Не ЗначениеЗаполнено(РодительНаборТестов) Тогда
			РодительОбъект = Справочники.ТС_НаборыТестов.СоздатьГруппу();
			РодительОбъект.Владелец = Курс;
			РодительОбъект.Наименование = РодительТестов.Наименование;
			РодительОбъект.Записать();
			РодительНаборТестов = РодительОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	ТекущийНаборТестов = Справочники.ТС_НаборыТестов.НайтиПоНаименованию(Наименование,,,Курс);
	Если Не ЗначениеЗаполнено(ТекущийНаборТестов) Тогда
		НаборТестовОбъект = Справочники.ТС_НаборыТестов.СоздатьЭлемент();
		НаборТестовОбъект.Владелец = Курс;
		НаборТестовОбъект.Наименование = Наименование;
		Если ЗначениеЗаполнено(РодительНаборТестов) Тогда НаборТестовОбъект.Родитель = РодительНаборТестов; КонецЕсли;
		НаборТестовОбъект.Записать();
		ТекущийНаборТестов = НаборТестовОбъект.Ссылка;
	КонецЕсли;
	//заполнить набор тестов
	НаборТестовОбъект = ТекущийНаборТестов.ПолучитьОбъект();
	НаборТестовОбъект.Раздел = РазделТестов;
	ТекДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТС_Тесты.Ссылка КАК Тест
	               |ИЗ
	               |	Справочник.ТС_Тесты КАК ТС_Тесты
	               |ГДЕ
	               |	ТС_Тесты.Родитель = &Родитель
	               |	И ВЫБОР
	               |			КОГДА &Устаревший = ИСТИНА
	               |				ТОГДА ТС_Тесты.Устаревший = &Устаревший
	               |			ИНАЧЕ ИСТИНА = ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Актуальный = ИСТИНА
	               |				ТОГДА ТС_Тесты.Актуальный = &Актуальный
	               |			ИНАЧЕ ИСТИНА = ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Устаревший", Ложь);
	Запрос.УстановитьПараметр("Актуальный", Истина);
	Запрос.УстановитьПараметр("Родитель", РазделТестов);
	РезультатЗапроса = Запрос.Выполнить();
	Содержание = НаборТестовОбъект.Содержание;
	Содержание.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Содержание.Добавить();
		НоваяСтрока.Тест = Выборка.Тест;
	КонецЦикла; 
	НаборТестовОбъект.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
