//*************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Параметры") И 
		Параметры.Свойство("ИмяМенеджераПечати") Тогда
		ЭтаФорма.Результат = ПолучитьТабличныйДокумент(Параметры.Параметры,Параметры.ИмяМенеджераПечати);
	КонецЕсли;
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;	
	
КонецПроцедуры

//*************************************************************
&НаСервере
Функция ПолучитьТабличныйДокумент(Параметры,ИмяМенеджераПечати)
	
	ТабДокумент = Неопределено;
	Выполнить("ТабДокумент = " + ИмяМенеджераПечати + "(Параметры)");
	Возврат ТабДокумент;
	
КонецФункции

