
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПараметрыСеанса.ТС_ТекущийПользователь;
	
	Для Каждого Значение Из Клавиша Цикл 
		
		Если Лев(Значение,1) = "_" Тогда
			Представление = Прав(Значение, СтрДлина(Значение) - 1);
		Иначе
			Представление = Строка(Значение);
		КонецЕсли;

		Элементы.ГорячиеКлавишиКлавишаСтрока.СписокВыбора.Добавить(Значение, Представление);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПараметрыТестированияПользователя.Пользователь КАК Пользователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПараметрыТестированияПользователя.ШиринаТекстаПодсказки, 0) = 0
		|			ТОГДА 10
		|		ИНАЧЕ ПараметрыТестированияПользователя.ШиринаТекстаПодсказки
		|	КОНЕЦ КАК ШиринаТекстаПодсказки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПараметрыТестированияПользователя.РазмерШтрифтаПодсказки, 0) = 0
		|			ТОГДА 12
		|		ИНАЧЕ ПараметрыТестированияПользователя.РазмерШтрифтаПодсказки
		|	КОНЕЦ КАК РазмерШтрифтаПодсказки,
		|	ПараметрыТестированияПользователя.СимуляцияЭкзамена КАК СимуляцияЭкзамена,
		|	ПараметрыТестированияПользователя.ГорячиеКлавиши КАК ГорячиеКлавиши
		|ИЗ
		|	РегистрСведений.ПараметрыТестированияПользователя КАК ПараметрыТестированияПользователя
		|ГДЕ
		|	ПараметрыТестированияПользователя.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаИзРегистра = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,Выборка,,"Пользователь,ГорячиеКлавиши"); 
		
		ГорячиеКлавиши.Очистить();
		ТаблицаИзРегистра = Выборка.ГорячиеКлавиши.Получить();
	Иначе
		ШиринаТекстаПодсказки = 10;
		РазмерШтрифтаПосказки = 12;
	КонецЕсли;
	
	Если ТаблицаИзРегистра = Неопределено Тогда
		ЗаполнитьГорячиеКлавишиПоУмолчанию();
	Иначе
		Для Каждого Стр Из ТаблицаИзРегистра Цикл
			ЗаполнитьЗначенияСвойств(ГорячиеКлавиши.Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерШтрифтаПосказкиПриИзменении(Элемент)
	ДанныеФормыИзменены();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаТекстаПодсказкиПриИзменении(Элемент)
	ДанныеФормыИзменены();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеФормыИзменены()
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметры(Команда)
	СохранитьПараметрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.ПараметрыТестированияПользователя.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтотОбъект,,"ГорячиеКлавиши"); 
	
	МенеджерЗаписи.ГорячиеКлавиши = Новый ХранилищеЗначения(ТС_ОбщегоНазначенияСервер.ПреобразоватьТаблицуЗначенийВМассивСтруктур(ГорячиеКлавиши.Выгрузить()));
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьГорячиеКлавишиПоУмолчанию()
	
	СписокКнопок = ПолучитьСписокКнопокФормы();
	
	Для Каждого КнопкаФормы Из СписокКнопок Цикл
		ЗаполнитьЗначенияСвойств(ГорячиеКлавиши.Добавить(), КнопкаФормы);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокКнопокФормы()
	
	СписокКнопок = Новый Массив;
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Команда_Галка1";
	Структура.Представление = "Выбрать ответ 1";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Команда_Галка2";
	Структура.Представление = "Выбрать ответ 2";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Команда_Галка3";
	Структура.Представление = "Выбрать ответ 3";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Команда_Галка4";
	Структура.Представление = "Выбрать ответ 4";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Команда_Галка5";
	Структура.Представление = "Выбрать ответ 5";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Команда_Галка6";
	Структура.Представление = "Выбрать ответ 6";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "ПодтвердитьОтвет";
	Структура.Представление = "Подтвердить ответ";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Далее";
	Структура.Представление = "Далее";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Назад";
	Структура.Представление = "Назад";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Подсказка";
	Структура.Представление = "Подсказка";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "ПоказатьОтвет";
	Структура.Представление = "Показать ответ";
	СписокКнопок.Добавить(Структура);
	
	Структура = ПолучитьСтруктуруКнопокФормы();
	Структура.ЭлементФормы = "Завершить";
	Структура.Представление = "Завершить";
	СписокКнопок.Добавить(Структура);
	
	Возврат СписокКнопок;
	
КонецФункции

Функция ПолучитьСтруктуруКнопокФормы()
	
	КнопкаПоУмолчанию = Элементы.ГорячиеКлавишиКлавишаСтрока.СписокВыбора[0];

	Структура = Новый Структура;
	
	Структура.Вставить("ЭлементФормы","");
	Структура.Вставить("Представление","");
	Структура.Вставить("КлавишаСтрока",КнопкаПоУмолчанию.Представление);
	Структура.Вставить("Клавиша", КнопкаПоУмолчанию.Значение);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ГорячиеКлавишиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГорячиеКлавишиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГорячиеКлавишиКлавишаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого Значение Из Клавиша Цикл 
		
		Если Лев(Значение,1) = "_" Тогда
			Представление = Прав(Значение, СтрДлина(Значение) - 1);
		Иначе
			Представление = Значение;
		КонецЕсли;
		
		
		ДанныеВыбора.Добавить(Значение, Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГорячиеКлавишиЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Элементы.ГорячиеКлавиши.ТекущиеДанные.Клавиша = ВыбранноеЗначение;
	
	Если Лев(ВыбранноеЗначение,1) = "_" Тогда
		Представление = Прав(ВыбранноеЗначение,СтрДлина(ВыбранноеЗначение) - 1);
	Иначе
		Представление = Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	Элементы.ГорячиеКлавиши.ТекущиеДанные.КлавишаСтрока = Представление;
	Элементы.ГорячиеКлавиши.ЗакончитьРедактированиеСтроки(Ложь);

КонецПроцедуры

Процедура ОбновитьВыбранныеДанные(Кнопка, Значение)
	
	ПараметрыОтбора = Новый Структура("Значение",Кнопка);
	НайденноеЗначение = ГорячиеКлавиши.НайтиСтроки(ПараметрыОтбора);
	НайденноеЗначение[0].Клавиша = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьПоУмолчанию(Команда)
	ГорячиеКлавиши.Очистить();
	ЗаполнитьГорячиеКлавишиПоУмолчанию();
КонецПроцедуры



